/* --------------------------------------------------------------------
 计算linear, poly, rbf核函数的值
-------------------------------------------------------------------- */

/* --- 输出的全部变量----------------------------------- */

extern double *dataA;   /* 第一个数据样本的指针*/
extern double *dataB;   /* 第二个数据样本的指针*/
extern long dim;        /* 样本的维数 */
extern int ker;         /* 核函数类别(0 - linear, 1 - polynom, 2 - rbf */
extern double *arg1;    /* 核函数的变量 */
extern long ker_cnt;    /* 计算出来的核函数的值 */
extern char *kernel_name[]; /* 核函数的名称 */


/* --- 输出函数------------------------------------------ */

/* --------------------------------------------------------------------
 计算数据集A,B的核函数
-------------------------------------------------------------------- */
extern double kernel( long a, long b );

/* --------------------------------------------------------------------
 将核函数的标识从字符型转化为int型
-------------------------------------------------------------------- */
int kernel_id( const mxArray *prhs1 );
